Model: "model_early_o_c3d_3d"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling3d (MaxPooling3D) multiple                  0         
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 multiple                  0         
_________________________________________________________________
ConvLayer0Dilat1 (Conv3D)    multiple                  3070      
_________________________________________________________________
ConvLayer1Dilat2 (Conv3D)    multiple                  1810      
_________________________________________________________________
ConvLayer2Dilat4 (Conv3D)    multiple                  1810      
_________________________________________________________________
ConvLayer3Dilat8 (Conv3D)    multiple                  1810      
_________________________________________________________________
ConvLayer4Dilat16 (Conv3D)   multiple                  1810      
_________________________________________________________________
ConvLayer5Dilat1 (Conv3D)    multiple                  1810      
_________________________________________________________________
ConvLayer6Dilat2 (Conv3D)    multiple                  1810      
_________________________________________________________________
ConvLayer7Dilat4 (Conv3D)    multiple                  1810      
_________________________________________________________________
ConvLayer8Dilat8 (Conv3D)    multiple                  1810      
_________________________________________________________________
ConvLayer9Dilat16 (Conv3D)   multiple                  1810      
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
_________________________________________________________________
dropout_2 (Dropout)          multiple                  0         
_________________________________________________________________
dropout_3 (Dropout)          multiple                  0         
_________________________________________________________________
dropout_4 (Dropout)          multiple                  0         
_________________________________________________________________
dropout_5 (Dropout)          multiple                  0         
_________________________________________________________________
dropout_6 (Dropout)          multiple                  0         
_________________________________________________________________
dropout_7 (Dropout)          multiple                  0         
_________________________________________________________________
dropout_8 (Dropout)          multiple                  0         
_________________________________________________________________
dropout_9 (Dropout)          multiple                  0         
_________________________________________________________________
add (Add)                    multiple                  0         
_________________________________________________________________
re_lu (ReLU)                 multiple                  0         
_________________________________________________________________
first_layerClassif0 (Dense)  multiple                  62750     
_________________________________________________________________
dropout_10 (Dropout)         multiple                  0         
_________________________________________________________________
classification (Dense)       multiple                  2008      
_________________________________________________________________
classification_aux (Dense)   multiple                  2008      
_________________________________________________________________
select1 (Dense)              multiple                  62750     
_________________________________________________________________
selectFinal (Dense)          multiple                  251       
_________________________________________________________________
concatenate (Concatenate)    multiple                  0         
=================================================================
Total params: 149,127
Trainable params: 149,127
Non-trainable params: 0
_________________________________________________________________
